Revit 2027 API
AnalyticalModelSelector.CurveSelector Property
 The portion of the curve to be selected.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalCurveSelector CurveSelector { get; set; }
Public Property CurveSelector As AnalyticalCurveSelector
	Get
	Set
public:
property AnalyticalCurveSelector CurveSelector {
	AnalyticalCurveSelector get ();
	void set (AnalyticalCurveSelector value);
}
member CurveSelector : AnalyticalCurveSelector with get, set
Property Value
AnalyticalCurveSelector
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalModelSelector Class
Autodesk.Revit.DB.Structure Namespace